src/cf/InformationRegisters/ПараметрыОбновленияНадежностьБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыОбновленияНадежностьБанков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СобытияНадежностьБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияНадежностьБанков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНадежностьБанков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоявленияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобытиеУдалено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/НадежностьБанков/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция СервисИспользуется() Экспорт
	
	Используется = ИнтернетПоддержкаПользователей.УслугаПодключена(ИдентификаторУслугиМониторингБанков())
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СобытияНадежностьБанков);
	
	Возврат Используется;
	
КонецФункции

Функция ИнформацияОКритичныхСобытиях(МассивБИК) Экспорт
	
	Результат = НоваяИнформацияОСобытиях();
	
	Результат.Используется = СервисИспользуется();
	Если НЕ Результат.Используется Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если МассивБИК.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат; // Данный функционал пока не используется
	
	ОбновитьСобытияВФоне(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция НовоеСобытие() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Событие");
	Результат.Вставить("ТекстСобытия");
	Результат.Вставить("ДатаСобытия");
	Результат.Вставить("ДатаПоявленияСобытия");
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Критичное");
	Результат.Вставить("ИсточникИнформации");
	Результат.Вставить("ТекстПояснения");
	Результат.Вставить("Показано");
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("ЕстьОстатки", Истина);
	ДополнительнаяИнформация.Вставить("ЕстьСчетаЮридическихЛиц", Истина);
	ДополнительнаяИнформация.Вставить("ЕстьСчетаФизическихЛиц", Истина);
	Результат.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
	
	Возврат Результат;

КонецФункции

Процедура ОбновитьСобытияВФоне(Результат)
	
	ПолучитьПоследнийИдентификаторСобытий(Результат);
	
	Если ДанныеСобытийАктуальны(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбновлениеСобытийВыполняется(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьНовыеСобытияВФоне(Результат);

КонецПроцедуры

Процедура ПолучитьНовыеСобытияВФоне(Результат)
	
	ИдентификаторФормы = Новый УникальныйИдентификатор;
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ЗаполнитьЗначенияСвойств(ПараметрыВыполнения, КлючНаименованиеЗаданияНовыеСобытия());
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПоследнийИдентификатор", Результат.ПоследнийИдентификатор);
	
	ПараметрыЗадания = ДлительныеОперации.ВыполнитьВФоне("НадежностьБанков.ПолучитьНовыеСобытияИзСервиса", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецПроцедуры

Функция НоваяИнформацияОСобытиях()

	Результат = Новый Структура;
	Результат.Вставить("Используется", Ложь);
	Результат.Вставить("Актуальность", Истина);
	Результат.Вставить("ПараметрыОбработчикаОжидания");
	Результат.Вставить("ПоследнийИдентификатор", 0);
	Результат.Вставить("События", Новый Соответствие); // Ключ - БИК, значение - см. НовоеСобытие.
	
	Возврат Результат;

КонецФункции

Функция ДанныеСобытийАктуальны(Результат)
	
	Отбор = Новый Структура("ОбластьДанныхВспомогательныеДанные", 
		ИнтернетПоддержкаПользователей.ЗначениеРазделителяСеанса());
	ПараметрыОбновления = РегистрыСведений.ПараметрыОбновленияНадежностьБанков.Получить(, Отбор);
	ПоследнееОбновление = ?(ТипЗнч(ПараметрыОбновления.ДатаОбновления) = Тип("Дата") 
		И ПараметрыОбновления.ДатаОбновления < ТекущаяДатаСеанса(), 
		ПараметрыОбновления.ДатаОбновления, 
		'00010101');
	Если НЕ ЗначениеЗаполнено(ПоследнееОбновление) Тогда
		Результат.Актуальность = Ложь;
	Иначе
		Результат.Актуальность = (ТекущаяДатаСеанса() - ПоследнееОбновление) < 15 * 60;
	КонецЕсли;
	
	Возврат Результат.Актуальность;

КонецФункции

Процедура ПолучитьПоследнийИдентификаторСобытий(Результат)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобытияНадежностьБанков.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.СобытияНадежностьБанков КАК СобытияНадежностьБанков
	|
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ПоследнийИдентификатор = 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.ПоследнийИдентификатор = Выборка.Идентификатор;
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновлениеСобытийВыполняется(Результат)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", КлючНаименованиеЗаданияНовыеСобытия().КлючФоновогоЗадания);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	НайденныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Возврат НайденныеЗадания.Количество() > 0;

КонецФункции

Функция КлючНаименованиеЗаданияНовыеСобытия()
	
	Результат = Новый Структура;
	Результат.Вставить("КлючФоновогоЗадания", "НадежностьБанковНовыеСобытия");
	Результат.Вставить("НаименованиеФоновогоЗадания", 
		НСтр("ru='Сервис ""Мониторинг банков"": получение новых событий'"));
	Возврат Результат;

КонецФункции

Функция ИдентификаторУслугиМониторингБанков()
	
	Возврат "1c-bank-monitoring";
	
КонецФункции

#КонецОбласти
